---
kind: other
id: Properties.T:Autodesk.Revit.UI.RibbonButton
source: html/f78b9c97-a841-b3d6-70fe-427079cc9e18.htm
---
# RibbonButton Properties

Gets or sets a value indicating whether the item is enabled.